name: "MLP"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_train_lmdb"
    batch_size: 100 
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_test_lmdb"
    batch_size: 100 
    backend: LMDB
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "data"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500 
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
	pruning_param {
		coeff: 0.6295816;
	}
}
layer {
	name: "bn1"
	type: "BatchNorm"
	bottom: "ip1"
	top: "bn1"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "bn1"
  top: "bn1"
}
layer {
	name: "drop1"
	type: "Dropout"
	bottom: "bn1"
	top: "bn1"
	dropout_param {
		dropout_ratio: 0.2
	}
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "bn1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500 
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
	pruning_param {
		coeff: 0.545032;
	}
}
layer {
	name: "bn2"
	type: "BatchNorm"
	bottom: "ip2"
	top: "bn2"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "bn2"
  top: "bn2"
}
layer {
	name: "drop2"
	type: "Dropout"
	bottom: "bn2"
	top: "bn2"
	dropout_param {
		dropout_ratio: 0.2
	}
}
layer {
  name: "ip3"
  type: "InnerProduct"
  bottom: "bn2"
  top: "ip3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 2000 
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
	pruning_param {
		coeff: 0.490861;
	}
}
layer {
	name: "bn3"
	type: "BatchNorm"
	bottom: "ip3"
	top: "bn3"
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
	param {
		lr_mult: 0
	}
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "bn3"
  top: "bn3"
}
layer {
	name: "drop3"
	type: "Dropout"
	bottom: "bn3"
	top: "bn3"
	dropout_param {
		dropout_ratio: 0.2
	}
}
layer {
  name: "ip4"
  type: "InnerProduct"
  bottom: "bn3"
  top: "ip4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
	pruning_param {
		coeff: 0.58615;
	}
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip4"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip4"
  bottom: "label"
  top: "loss"
}
